
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Если НЕ ЗначениеЗаполнено(Объект.ИнтернетМагазин) Тогда
	//	Объект.ЭтоТест = Истина;
	//	ПолнаяВыгрузка = Истина;
	//КонецЕсли;
	НастройкиУстановить();
	
	//Если Объект.ЭтоТест Тогда
	//	Элементы.ЭтоТест.Видимость	= Истина;
	//КонецЕсли;
	ДоступУстановить();
	Элементы.СписокСоздаваемыхКарточек.Обновить();
	Элементы.Проблемные.Обновить();
КонецПроцедуры

&НаСервере
Процедура НастройкиУстановить()
	НаСервере().НастройкиУстановить(Объект);
	ОтборыУстановить();
КонецПроцедуры

&НаСервере
Процедура ОтборыУстановить()
	СписокСоздаваемыхКарточек.Параметры.УстановитьЗначениеПараметра("ИнтернетМагазин", Объект.ИнтернетМагазин);
	Проблемные.Параметры.УстановитьЗначениеПараметра("ИнтернетМагазин", Объект.ИнтернетМагазин);
КонецПроцедуры

&НаСервере
Процедура Алло(Сообщение)
	Если НЕ ПустаяСтрока(Сообщение) Тогда
		Сообщить(Сообщение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИмпортШтрихкодовНаСервере()
	НаСервере().ВыполнитьКоманду("GET_ITEMS");
КонецПроцедуры

&НаКлиенте
Процедура ИмпортШтрихкодов(Команда)
	Если ПроверитьЗаполнение() Тогда
		ИмпортШтрихкодовНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗаказыНаСервере()
	ТаблицаЗаказов = НаСервере().ПолучитьТаблицуЗаказовИзСайта();
	Сообщить(ТаблицаЗаказов.Количество());
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЗаказы(Команда)
	ПолучитьЗаказыНаСервере();
КонецПроцедуры

&НаСервере
Процедура UPDATESTOCKНаСервере()
	НаСервере().ВыполнитьКоманду("UPDATE_STOCK");
КонецПроцедуры

&НаКлиенте
Процедура UPDATESTOCK(Команда)
	UPDATESTOCKНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуДляОстатков()
	ТекущееВремя = ТекущаяДата();
	Разница = ТекущееВремя - УниверсальноеВремя(ТекущееВремя);
	Если Разница < 0 Тогда
		Разница = -Разница;
	КонецЕсли;	
	РазницаЧасы = Разница/3600;
	//Минуты = РазницаЧасы % 1;
	//ДобавкаМинуты = "00";
	//Если Минуты = 0 Тогда
	//	ДобавкаМинуты = "00";
	//ИначеЕсли Минуты = 0.5 Тогда
	//	ДобавкаМинуты = "30";
	//КонецЕсли;
	Добавка = "+" + ПеревестиВДвузначноеЧисло(Цел(РазницаЧасы)) + ":" + ?(РазницаЧасы % 1 = 0, "00", "30");
	Время = Формат(ТекущееВремя, "ДФ='гггг-ММ-дд''T''ЧЧ:мм:сс'");
	Возврат Время + Добавка;
КонецФункции

&НаСервере
Функция ПеревестиВДвузначноеЧисло(Число)
	Если Число > 9 Тогда
		Результат = Строка(Число);		
	Иначе
		Результат = "0" + Строка(Число);	
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
Процедура UPDATEPRICESНаСервере()
	НаСервере().SEND_PRICES();
КонецПроцедуры

&НаКлиенте
Процедура UPDATEPRICES(Команда)
	Если ПроверитьЗаполнение() Тогда
		Если Объект.ЭтоТест Тогда
			//
		Иначе
			UPDATEPRICESНаСервере();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	Если ПроверитьЗаполнение() Тогда
		КомандаОбновитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КомандаОбновитьНаСервере()
	Объект.Цены.Очистить();
	
	Объект.Цены.Загрузить(НаСервере().ВыгрузитьЦены(50));
КонецПроцедуры

&НаСервере
Процедура КомандаРегистрЦенЗаполнитьНаСервере()
	НаСервере().ВыполнитьКоманду("COPY_PRICES");
КонецПроцедуры

&НаКлиенте
Процедура КомандаРегистрЦенЗаполнить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ВидЦены) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено",, "ВидЦены", "Объект.ВидЦены");
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ВидЦеныБазис) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено",, "ВидЦеныБазис", "Объект.ВидЦеныБазис");
	ИначеЕсли ПроверитьЗаполнение() Тогда
		КомандаРегистрЦенЗаполнитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИнтернетМагазинПриИзменении(Элемент)
	НастройкиУстановить();
КонецПроцедуры

&НаСервере
Функция НаСервере()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции

&НаСервере
Функция СправочникСлужбДоставкиНаСервере()
	Ответ	= Новый ТабличныйДокумент;
	АдресРесурса	= "https://api.partner.market.yandex.ru/v2/delivery/services.json";
	ДополнительныеПараметры = РеквизитФормыВЗначение("Объект").ПолучитьЗаголовкиЗапросаHTTP();
	МассивДанных = КоннекторHTTP.GetJson(АдресРесурса,, ДополнительныеПараметры);
	Если ТипЗнч(МассивДанных.Получить("result")) = Тип("Соответствие")
	И ТипЗнч(МассивДанных.Получить("result").Получить("deliveryService")) = Тип("Массив")
	Тогда
		Макет = НаСервере().ПолучитьМакет("СправочникСлужбДоставки");
		Область = Макет.ПолучитьОбласть("Детали");
		Службы = МассивДанных.Получить("result").Получить("deliveryService");
		Для Каждого Служба Из Службы Цикл
			Область.Параметры.id	= Служба.Получить("id");
			Область.Параметры.name	= Служба.Получить("name");
			Ответ.Вывести(Область);
		КонецЦикла;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура КомандаСправочникСлужбДоставки(Команда)
	Ответ = СправочникСлужбДоставкиНаСервере();
	Ответ.Показать("Справочник служб доставки");
КонецПроцедуры

&НаСервере
Функция ПоказатьОстаткиНаСервере(Артикул="")
	Если Объект.ЭтоТест Тогда
		Ответ	= Новый ТабличныйДокумент;
		Макет = НаСервере().ПолучитьМакет("СправочникСлужбДоставки");
		Область = Макет.ПолучитьОбласть("Детали");
		МассивSKU	= АртикулыПример(Истина);
		Для Каждого ТекЭлемент Из МассивSKU Цикл
			Область.Параметры.id	= ТекЭлемент;
			Ответ.Вывести(Область);
		КонецЦикла;
		Возврат Ответ;
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Товар.Артикул + Характеристики.Наименование КАК SKU
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК Характеристики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товар
	|		ПО Характеристики.Владелец = Товар.Ссылка
	|ГДЕ
	|	Товар.Артикул >= &Артикул
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товар.Артикул");
	Запрос.УстановитьПараметр("ИнтернетМагазин",	Объект.ИнтернетМагазин);
	Запрос.УстановитьПараметр("Артикул",			Артикул);
	Если ПустаяСтрока(Артикул) Тогда
		//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 10
		//               |	Товар.Артикул + Характеристики.Наименование КАК SKU
		//               |ИЗ
		//               |	Справочник.ХарактеристикиНоменклатуры КАК Характеристики
		//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товар
		//               |		ПО Характеристики.Владелец = Товар.Ссылка
		//               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнтернетМагазинОстатки КАК Остатки
		//               |		ПО Характеристики.Ссылка = Остатки.Характеристика
		//               |ГДЕ
		//               |	Остатки.Характеристика ЕСТЬ NULL
		//               |
		//               |УПОРЯДОЧИТЬ ПО
		//               |	Товар.Артикул";
		//Запрос.УстановитьПараметр("Артикул",			СтрРазделить(Артикул, ",", Ложь));
		МассивSKU	= АртикулыПример(Истина);
	Иначе
		МассивSKU	= Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	КонецЕсли;

	warehouseId	= 1;
	Выборка = ИнтеграцияWB.ПолучитьОстаткиТоваров(МассивSKU, Объект.ИнтернетМагазин);
	
	ДанныеОТоварах	= Новый Массив;
	ДатаФормат		= _ТекущаяДатаСеанса();
	Для Каждого ТекСтрока Из Выборка Цикл
		Остаток = Новый Структура("warehouseId,shopSku", warehouseId, ТекСтрока.SKU);
		
		МассивАйтем = Новый Массив;
		МассивАйтем.Добавить(Новый Структура("type,updatedAt,count", "FIT", ДатаФормат, ТекСтрока.count));
		Остаток.Вставить("items", МассивАйтем);
		
		ДанныеОТоварах.Добавить(Остаток);
	КонецЦикла;
	
	ДокументРезультат = Новый ТекстовыйДокумент;
	ДокументРезультат.УстановитьТекст(JSONМодуль.ЗаписатьJSON1(Новый Структура("skus", ДанныеОТоварах)));
	Возврат ДокументРезультат.ПолучитьТекст();
КонецФункции

&НаСервере
Функция _ТекущаяДатаСеанса()
	Возврат ИнтеграцияИС.ДатаСЧасовымПоясом(ТекущаяДатаСеанса());
КонецФункции

&НаКлиенте
Процедура ПоказатьОстатки(Результат, Параметры) Экспорт
	//Если НЕ ПустаяСтрока(Результат) Тогда
		ДокументРезультат = ПоказатьОстаткиНаСервере(Результат);
		Если НЕ ПустаяСтрока(ДокументРезультат) Тогда
			ПоказатьЗначение(, ДокументРезультат);
		КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьОстатки(Команда) Экспорт
	Если ПроверитьЗаполнение() Тогда
		Если Объект.ЭтоТест Тогда
			Ответ = ПоказатьОстаткиНаСервере();
			Ответ.Показать("SKU");
		Иначе
			ф=АртикулыПример();
			ПоказатьВводСтроки(Новый ОписаниеОповещения("ПоказатьОстатки", ЭтотОбъект), ф, "Введите Артикул (достаточно первых двух)");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция АртикулыПример(КакМассив=Ложь)
	Если КакМассив Тогда
		// тестовый запрос Яндекса
		СоответствиеДанных = НаСервере().МассивДанныхПолучить("YA_STOCKS");
		МассивДанных = СоответствиеДанных.Получить("skus");
		Возврат МассивДанных;
	КонецЕсли;
	Возврат "0KKB46570ODMID";
КонецФункции

&НаКлиенте
Процедура ЭтоТестПриИзменении(Элемент)
	ДоступУстановить();
КонецПроцедуры

&НаКлиенте
Процедура ДоступУстановить()
	Если Объект.ЭтоТест Тогда
		Элементы.UPDATEPRICES.Видимость						= Ложь;
		Элементы.КомандаСправочникСлужбДоставки.Видимость	= Истина;
	Иначе
		Элементы.UPDATEPRICES.Видимость						= Истина;
		Элементы.КомандаСправочникСлужбДоставки.Видимость	= Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АдресФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	КомандаФайлЗагрузить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаФайлЗагрузить(Команда=Неопределено)
	Если Элементы.ГруппаОсновная.ТекущаяСтраница.Имя = "ГруппаСписокСоздаваемыхКарточек" Тогда
		ВариантЗагрузки = 5;
	ИначеЕсли Элементы.ГруппаОсновная.ТекущаяСтраница.Имя = "ГруппаИмпорт" Тогда
		ВариантЗагрузки = 4;
	Иначе
		ВариантЗагрузки = ?(Элементы.ГруппаОсновная.ТекущаяСтраница.Имя = "ГруппаЦены", 1, ?(Элементы.ГруппаОсновная.ТекущаяСтраница.Имя = "ГруппаКатегории", 3, 2));
	КонецЕсли;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Фильтр = "Файл Microsoft Excel (*.xlsx)|*.xlsx|Табличный документ (*.mxl)|*.mxl";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект, Новый Структура("Диалог", ДиалогОткрытияФайла)), ДиалогОткрытияФайла);
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, Контекст) Экспорт
	ДиалогОткрытияФайла = Контекст.Диалог;
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
		ПолноеИмяФайла = ДиалогОткрытияФайла.ПолноеИмяФайла;
		Попытка
			НачатьПомещениеФайла(Новый ОписаниеОповещения("ВыполнитьЗагрузку", ЭтаФорма),, ПолноеИмяФайла, Ложь, УникальныйИдентификатор); 
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузку(Результат, Адрес, ПолноеИмяФайла, ДополнительныеПараметры) Экспорт 
	Если Результат Тогда
	    ЗагрузитьНаСервере(Адрес, Сред(ПолноеИмяФайла, СтрНайти(ПолноеИмяФайла, ".", НаправлениеПоиска.СКонца) + 1));
		Если ВариантЗагрузки = 1 И Объект.Цены.Количество() > 0 Тогда
			Элементы.ГруппаТабДок.Скрыть();
		ИначеЕсли ВариантЗагрузки = 2 И Объект.Размеры.Количество() > 0 Тогда
			Элементы.ГруппаТабДок.Скрыть();
		ИначеЕсли ВариантЗагрузки = 3 И Объект.Категории.Количество() > 0 Тогда
			Элементы.ГруппаТабДок.Скрыть();
		ИначеЕсли ВариантЗагрузки = 5 И Объект.СписокКарточек.Количество() > 0 Тогда
			Элементы.ГруппаТабДок.Скрыть();
		КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(Знач Адрес, Расширение) 
	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(Адрес);
    ИмяФайла				= ПолучитьИмяВременногоФайла(Расширение);
	Попытка
	    ФайлВременногоХранилища.Записать(ИмяФайла);
	    УдалитьИзВременногоХранилища(Адрес);
		ТабДок.Прочитать(ИмяФайла);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
    УдалитьФайлы(ИмяФайла);
	//	загрузка файла
	Если ВариантЗагрузки = 1 Тогда
		Танкер1();
	ИначеЕсли ВариантЗагрузки = 3 Тогда
		Танкер3();
	ИначеЕсли ВариантЗагрузки = 4 Тогда
		Танкер4();
	ИначеЕсли ВариантЗагрузки = 5 Тогда
		Танкер5();
	Иначе
		Танкер2();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Танкер5()
	Колонка_sku			= 0;
	Колонка_ЦенаБазис	= 0;
	Колонка_Цена		= 0;
	Колонка_Артикул		= 0;
	Колонка_Баркод		= 0;
	нн		= 1;
	ИмяКолонки			= "/";
	Пока НЕ ПустаяСтрока(ИмяКолонки) Цикл
		ИмяКолонки 	 = ТабДок.Область(1, нн, 1, нн).Текст;
		Если СтрСравнить(СокрЛП(ИмяКолонки), "Barcodes") = 0 Тогда
			Колонка_Баркод	= нн;
		//ИначеЕсли НРег(ИмяКолонки) = "sku" Тогда
		//	Колонка_sku	= нн;
		ИначеЕсли НРег(ИмяКолонки) = "first price" Тогда
			Колонка_ЦенаБазис	= нн;
		ИначеЕсли СтрСравнить(СокрЛП(ИмяКолонки), "sales price") = 0 Тогда
			Колонка_Цена	= нн;
		//ИначеЕсли НРег(ИмяКолонки) = "last price" Тогда
		//	Колонка_Цена	= нн;
		//ИначеЕсли НРег(ИмяКолонки) = "sale price" Тогда		//	Sale Price
		//	Колонка_Цена	= нн;
		ИначеЕсли НРег(ИмяКолонки) = "option" Тогда
			Колонка_Артикул	= нн;

		ИначеЕсли Колонка_ЦенаБазис * Колонка_Цена * Макс(Колонка_sku, Колонка_Баркод) > 0 Тогда
			Прервать;
		КонецЕсли;
		нн = нн + 1;
	КонецЦикла;
	
	//	заполнение Списка карточек
	Если Макс(Колонка_sku, Колонка_Баркод) > 0 Тогда
		Период		= НачалоЧаса(ТекущаяДатаСеанса());
		Объект.СписокКарточек.Очистить();
		нн	= 1;
		Пока нн <= ?(Объект.ЭтоТест, 99, ТабДок.ВысотаТаблицы) Цикл
			нн = нн + 1;
			ТекСтрока	= Новый Структура("Номенклатура,Характеристика");
			//Если Колонка_Баркод > 0 Тогда
				ТекСтрока.Вставить("ШтрихкодИД",	ТабДок.Область(нн, Колонка_Баркод, нн, Колонка_Баркод).Текст);
				ТекСтрока.Вставить("ШтрихкодИД2",	ТекСтрока.ШтрихкодИД);
				НоменклатураПоБаркоду(ТекСтрока.ШтрихкодИД, ТекСтрока);
			//КонецЕсли;
			//Если НЕ ЗначениеЗаполнено(ТекСтрока.Характеристика) Или НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) И Колонка_sku > 0 Тогда
			//	Артикул	= Лев(ТабДок.Область(нн, Колонка_sku, нн, Колонка_sku).Текст, 14);
			//	Размер	= Сред(ТабДок.Область(нн, Колонка_sku, нн, Колонка_sku).Текст, 15);
			//	Если ПустаяСтрока(Артикул) Или ПустаяСтрока(Размер) Тогда
			//		Прервать;
			//	ИначеЕсли НоменклатураПоРазмеру(Артикул, Размер, ТекСтрока) Тогда
			//		Продолжить;
			//	КонецЕсли;
			//КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ТекСтрока.Характеристика) Или НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда Продолжить; КонецЕсли;
			
			//Ошибок	= ?(Колонка_ЦенаБазис=0, 1, 0);
			Если Колонка_ЦенаБазис > 0 Тогда
				ТекСтрока.Вставить("ЦенаБазис", ТабДок.Область(нн, Колонка_ЦенаБазис, нн, Колонка_ЦенаБазис).Текст);
				//Ошибок	= Ошибок + ?(ПустаяСтрока(ТекСтрока.ЦенаБазис), 1, 0);
			КонецЕсли;
			Если Колонка_Цена > 0 Тогда
				ТекСтрока.Вставить("Цена", ТабДок.Область(нн, Колонка_Цена, нн, Колонка_Цена).Текст);
				//Ошибок	= Ошибок + ?(ПустаяСтрока(ТекСтрока.Цена), 2, 0);
			КонецЕсли;
			//Если Ошибок > 1 Тогда
			//	Прервать;
			//Иначе
				Если НоменклатураДописать(ТекСтрока) Тогда
					ТекСтрока.Вставить("Период",		Период);
					ЗаполнитьЗначенияСвойств(Объект.СписокКарточек.Добавить(), ТекСтрока);
				КонецЕсли;
			//КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НоменклатураДописать(СтруктураПараметров)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(ПОДСТРОКА(Цветы.Значение, 1, 30), СписокКарточек.Цвет) КАК Цвет,
	|	ЕСТЬNULL(Размеры.Значение, СписокКарточек.РосРазмер) КАК РосРазмер,
	|	ЕСТЬNULL(СоставыТкани.НаименованиеЛокальный, ПОДСТРОКА(ЕСТЬNULL(СловарьДанныхСостав.Значение, СписокКарточек.Состав), 1, 150)) КАК Состав,
	|	ЕСТЬNULL(КлассификаторТНВЭД.Код, СписокКарточек.ТНВЭД) КАК ТНВЭД
	|ИЗ
	|	РегистрСведений.мп_СписокСоздаваемыхКарточек КАК СписокКарточек
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнтернетМагазины КАК ИнтернетМагазины
	|		ПО СписокКарточек.ИнтернетМагазин = ИнтернетМагазины.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товар
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мп_ДанныеКарточек КАК Цветы
	|			ПО Товар.Цвет = Цветы.СсылкаОбъекта
	|				И (Цветы.Аттрибут = ЗНАЧЕНИЕ(Справочник.мп_АттрибутыКарточек.Цвет))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатурныйСоставыТкани КАК НоменклатурныйСоставыТкани
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КТ_НоменклатурныйСоставТкани КАК СоставыТкани
	|				ПО НоменклатурныйСоставыТкани.Наименование = СоставыТкани.Наименование
	|			ПО Товар.СоставТкани = НоменклатурныйСоставыТкани.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СловарьДанных КАК СловарьДанныхСостав
	|			ПО Товар.СоставТкани = СловарьДанныхСостав.СсылкаОбъекта
	|				И (СловарьДанныхСостав.Язык = &Язык)
	|		ПО СписокКарточек.Номенклатура = Товар.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыТНВЭД.СрезПоследних(, Страна = &Страна) КАК КодыТНВЭД
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|			ПО КодыТНВЭД.ТНВЭД = КлассификаторТНВЭД.Ссылка
	|		ПО СписокКарточек.Номенклатура = КодыТНВЭД.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнтернетМагазинРазмеры КАК Размеры
	|		ПО СписокКарточек.Номенклатура._MopClass = Размеры.Категория
	|			И СписокКарточек.Номенклатура._MopSubDepartment = Размеры.Пол
	|			И СписокКарточек.Характеристика.Наименование = Размеры.Размер
	|ГДЕ
	|	СписокКарточек.Характеристика = &Характеристика
	|	И СписокКарточек.Номенклатура = &Номенклатура
	|	И ИнтернетМагазины.Страна = &Страна
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписокКарточек.ИнтернетМагазин = &ИнтернетМагазин УБЫВ,
	|	Цвет УБЫВ");
	Запрос.УстановитьПараметр("Характеристика",		СтруктураПараметров.Характеристика);
	Запрос.УстановитьПараметр("Номенклатура",		СтруктураПараметров.Номенклатура);
	Запрос.УстановитьПараметр("ИнтернетМагазин",	Объект.ИнтернетМагазин);
	Запрос.УстановитьПараметр("Страна",				Объект.Страна);
	Запрос.УстановитьПараметр("Язык",				Объект.Язык);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураПараметров.Вставить("Цвет",		Выборка.Цвет);
		СтруктураПараметров.Вставить("РосРазмер",	Выборка.РосРазмер);
		СтруктураПараметров.Вставить("Состав",		Выборка.Состав);
		СтруктураПараметров.Вставить("ТНВЭД",		Выборка.ТНВЭД);
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Функция НоменклатураПоРазмеру(Артикул, Размер, Приемник)
	Запрос	= Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ХарактеристикиНоменклатуры.Владелец КАК Владелец,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Наименование = &Размер
	|	И Номенклатура.Артикул = &Артикул
	|
	|УПОРЯДОЧИТЬ ПО
	|	ХарактеристикиНоменклатуры.ПометкаУдаления");
	Запрос.УстановитьПараметр("Артикул",		Артикул);
	Запрос.УстановитьПараметр("Размер",			Размер);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Приемник, Выборка);
		Возврат Истина
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Функция НоменклатураПоБаркоду(БарКод, Приемник)
	Запрос	= Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Штрихкоды.Владелец КАК Номенклатура,
	|	Штрихкоды.Характеристика КАК Характеристика
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &Штрихкод
	|
	|УПОРЯДОЧИТЬ ПО
	|	Характеристика УБЫВ");
	Запрос.УстановитьПараметр("Штрихкод",		БарКод);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Приемник, Выборка);
		Возврат Истина
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Функция СсылкаОбъектаНайти(ИмяСправочника, Значение, Списком=Ложь)
	Ответ = Неопределено;
	Если НЕ ПустаяСтрока(Значение) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Виктим.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БазовыеЕдиницыИзмерения КАК Виктим
		|ГДЕ
		|	(Виктим.Наименование = &Значение
		|			ИЛИ Виктим.Код = &Значение)");
		Запрос.Текст	= СтрЗаменить(Запрос.Текст, "БазовыеЕдиницыИзмерения", ИмяСправочника);
		Запрос.УстановитьПараметр("Значение",	Значение);
		Выборка = Запрос.Выполнить().Выбрать();
		Если НЕ Списком И Выборка.Следующий() Тогда
			Ответ = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	Возврат ?(Списком, Выборка, Ответ);
КонецФункции

&НаСервере
Функция ИмяСправочникаНайти(Синоним)
	Ответ = "";
	Для Каждого ТекСправочник Из Метаданные.Справочники Цикл
		Если СтрСравнить(ТекСправочник.Синоним, Синоним) = 0 Тогда
			Ответ = ТекСправочник.Имя;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Ответ;
КонецФункции

&НаСервере
Процедура Танкер4()
	//	заполнение Импорт
	Объект.Импорт.Очистить();
	
	Колонка_СсылкаОбъекта		= 1;
	Колонка_ТипСсылкаОбъекта	= 2;
	Колонка_Аттрибут			= 3;
	Колонка_ИнтернетМагазин		= 4;
	Колонка_Значение			= 5;
	
	мСправочники	= Новый Соответствие;
	
	мм	= ?(Объект.ЭтоТест, 9, ТабДок.ВысотаТаблицы);
	Для нн = 2 По мм Цикл
		ТипСсылкаОбъекта	= ТабДок.Область(нн, Колонка_ТипСсылкаОбъекта, нн, Колонка_ТипСсылкаОбъекта).Текст;
		ИмяСправочника		= мСправочники.Получить(ТипСсылкаОбъекта);
		Если ИмяСправочника = Неопределено Тогда
			ИмяСправочника		= ИмяСправочникаНайти(ТипСсылкаОбъекта);
			Если ПустаяСтрока(ИмяСправочника) Тогда
				Продолжить;
			Иначе
				мСправочники.Вставить(ТипСсылкаОбъекта, ИмяСправочника);
			КонецЕсли;
		КонецЕсли;
		ТекСтрока	= Новый Структура("ТипСсылкаОбъекта", ИмяСправочника);
		Список		= СсылкаОбъектаНайти(ИмяСправочника, ТабДок.Область(нн, Колонка_СсылкаОбъекта, нн, Колонка_СсылкаОбъекта).Текст, Истина);
		Пока Список.Следующий()	Цикл
			ТекСтрока.Вставить("СсылкаОбъекта", Список.Ссылка);
			Если ЗначениеЗаполнено(ТекСтрока.СсылкаОбъекта) Тогда
				ТекСтрока.Вставить("Аттрибут",			СсылкаОбъектаНайти("мп_АттрибутыКарточек", СокрЛП(ТабДок.Область(нн, Колонка_Аттрибут, нн, Колонка_Аттрибут).Текст)));
				ТекСтрока.Вставить("ИнтернетМагазин",	СсылкаОбъектаНайти("ИнтернетМагазины", СокрЛП(ТабДок.Область(нн, Колонка_ИнтернетМагазин, нн, Колонка_ИнтернетМагазин).Текст)));
				Если Объект.Импорт.НайтиСтроки(Новый Структура("Аттрибут,СсылкаОбъекта,ИнтернетМагазин", ТекСтрока.Аттрибут, ТекСтрока.СсылкаОбъекта, ТекСтрока.ИнтернетМагазин)).Количество() = 0 Тогда
					ТекСтрока.Вставить("Значение",			СокрЛП(ТабДок.Область(нн, Колонка_Значение, нн, Колонка_Значение).Текст));
					ЗаполнитьЗначенияСвойств(Объект.Импорт.Добавить(), ТекСтрока);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура Танкер3()
	//	заполнение Категории
	Объект.Категории.Очистить();
	
	Колонка_MopDivision			= 0;
	Колонка_MopDepartment		= 0;
	Колонка_MopSubDepartment	= 0;
	Колонка_MopCategory			= 0;
	Колонка_MopClass			= 0;
	Колонка_мп_Категория		= 0;
	Колонка_Комплектация		= 0;
	Колонка_КомплектацияID		= 0;
	Колонка_Категория			= 0;
	Колонка_КатегорияID			= 0;
	нн			= 1;
	ИмяКолонки	= "/";
	Пока НЕ ПустаяСтрока(ИмяКолонки) Цикл
		ИмяКолонки 	 = НРег(ТабДок.Область(1, нн, 1, нн).Текст);
		Если ИмяКолонки = "division" Тогда
			Колонка_MopDivision	= нн;
		ИначеЕсли ИмяКолонки = "department" Тогда
			Колонка_MopDepartment	= нн;
		ИначеЕсли ИмяКолонки = "subdepartment" Тогда
			Колонка_MopSubDepartment	= нн;
		ИначеЕсли НРег(ИмяКолонки) = "category" Тогда
			Колонка_MopCategory	= нн;
		ИначеЕсли НРег(ИмяКолонки) = "class" Тогда
			Колонка_MopClass	= нн;
		ИначеЕсли НРег(ИмяКолонки) = "koton id" Тогда
			Колонка_мп_Категория	= нн;
		ИначеЕсли СтрСравнить(ИмяКолонки, "Комплектация") = 0 Тогда
			Колонка_Комплектация	= нн;
		ИначеЕсли СтрСравнить(ИмяКолонки, "КомплектацияID") = 0 Тогда
			Колонка_КомплектацияID	= нн;
		ИначеЕсли СтрСравнить(ИмяКолонки, "Категория") = 0 Тогда
			Колонка_Категория		= нн;
		ИначеЕсли СтрСравнить(ИмяКолонки, "КатегорияID") = 0 Тогда
			Колонка_КатегорияID		= нн;
			
		ИначеЕсли Колонка_MopDivision * Колонка_MopDepartment * Колонка_MopSubDepartment * Колонка_MopCategory * Колонка_MopClass * Колонка_мп_Категория * Колонка_Комплектация * Колонка_КомплектацияID * Колонка_Категория * Колонка_КатегорияID > 0 Тогда
			Прервать;
		КонецЕсли;
		нн = нн + 1;
	КонецЦикла;
	
	Если Колонка_MopDivision * Колонка_MopDepartment * Колонка_MopSubDepartment * Колонка_MopCategory * Колонка_MopClass * Колонка_мп_Категория > 0 Тогда
		мм	= ?(Объект.ЭтоТест, 9, ТабДок.ВысотаТаблицы);
		Для нн = 2 По мм Цикл
			Атрибут	= ТабДок.Область(нн, Колонка_мп_Категория, нн, Колонка_мп_Категория).Текст;
			Если ПустаяСтрока(Атрибут) Тогда
				Продолжить;
			КонецЕсли;
			ТекСтрока	= Новый Структура("Ошибка,мп_Категория,MopDivision,MopDepartment,MopSubDepartment,MopCategory,MopClass", Ложь, Атрибут);
			Если Колонка_Комплектация * Колонка_КомплектацияID * Колонка_Категория * Колонка_КатегорияID > 0 Тогда
				ТекСтрока.Вставить("КатегорияID",		СокрЛП(ТабДок.Область(нн, Колонка_КатегорияID, нн, Колонка_КатегорияID).Текст));
				ТекСтрока.Вставить("Категория",			СокрЛП(ТабДок.Область(нн, Колонка_Категория, нн, Колонка_Категория).Текст));
				ТекСтрока.Вставить("КомплектацияID",	СокрЛП(ТабДок.Область(нн, Колонка_КомплектацияID, нн, Колонка_КомплектацияID).Текст));
				ТекСтрока.Вставить("Комплектация",		СокрЛП(ТабДок.Область(нн, Колонка_Комплектация, нн, Колонка_Комплектация).Текст));
				
				Шерлок	= Новый Структура("КомплектацияID,Комплектация,Категория");
				ЗаполнитьЗначенияСвойств(Шерлок, ТекСтрока);
				Прошлое	= Объект.Категории.НайтиСтроки(Шерлок);
				//Если Прошлое.Количество() > 0 Тогда
					Для Каждого Было Из Прошлое Цикл
						ТекСтрока.КатегорияID = Было.КатегорияID;
						Прервать;
					КонецЦикла;
				//КонецЕсли;
			КонецЕсли;
			
			//Если мп_Категории_Найти(ТекСтрока) Тогда
			//	ЗаполнитьЗначенияСвойств(Объект.Категории.Добавить(), ТекСтрока);
			//	Продолжить;
			//КонецЕсли;
			
			ТекСтрока.Вставить("MopDivision", 		MopDivisionНайти(ТабДок.Область(нн, Колонка_MopDivision, нн, Колонка_MopDivision).Текст));
			ТекСтрока.Вставить("MopDepartment", 	MopDepartmentНайти(ТабДок.Область(нн, Колонка_MopDepartment, нн, Колонка_MopDepartment).Текст));
			ТекСтрока.Вставить("MopSubDepartment", 	MopSubDepartmentНайти(ТабДок.Область(нн, Колонка_MopSubDepartment, нн, Колонка_MopSubDepartment).Текст));
			ТекСтрока.Вставить("MopCategory", 		MopCategoryНайти(ТабДок.Область(нн, Колонка_MopCategory, нн, Колонка_MopCategory).Текст));
			ТекСтрока.Вставить("MopClass", 			MopClassНайти(ТабДок.Область(нн, Колонка_MopClass, нн, Колонка_MopClass).Текст));
			Если НЕ мп_Категории_Подобрать(ТекСтрока) Тогда
				ТекСтрока.Ошибка	= Истина;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Объект.Категории.Добавить(), ТекСтрока);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция мп_Категории_Подобрать(Параметры)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Категории.Ссылка КАК мп_Категория
	|ИЗ
	|	Справочник.мп_Категории КАК Категории
	|ГДЕ
	|	Категории._MopClass = &MopClass
	|	И Категории._MopCategory = &MopCategory
	|	И Категории._MopSubDepartment = &MopSubDepartment
	|	И Категории._MopDepartment = &MopDepartment
	|	И Категории._MopDivision = &MopDivision
	|
	|УПОРЯДОЧИТЬ ПО
	|	Категории.ПометкаУдаления");
	Запрос.УстановитьПараметр("MopDivision",		Параметры.MopDivision);
	Запрос.УстановитьПараметр("MopDepartment",		Параметры.MopDepartment);
	Запрос.УстановитьПараметр("MopSubDepartment",	Параметры.MopSubDepartment);
	Запрос.УстановитьПараметр("MopCategory",		Параметры.MopCategory);
	Запрос.УстановитьПараметр("MopClass",			Параметры.MopClass);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Параметры, Выборка);
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервереБезКонтекста
Функция MopDivisionНайти(Наименование)
	Ответ = Неопределено;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Mop.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.MopDivision КАК Mop
	|ГДЕ
	|	Mop.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Наименование",	Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ = Выборка.Ссылка;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервереБезКонтекста
Функция MopDepartmentНайти(Наименование)
	Ответ = Неопределено;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Mop.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.MopDepartment КАК Mop
	|ГДЕ
	|	Mop.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Наименование",	Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ = Выборка.Ссылка;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервереБезКонтекста
Функция MopSubDepartmentНайти(Наименование)
	Ответ = Неопределено;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Mop.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.MopSubDepartment КАК Mop
	|ГДЕ
	|	Mop.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Наименование",	Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ = Выборка.Ссылка;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервереБезКонтекста
Функция MopCategoryНайти(Наименование)
	Ответ = Неопределено;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Mop.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.MopCategory КАК Mop
	|ГДЕ
	|	Mop.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Наименование",	Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ = Выборка.Ссылка;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервереБезКонтекста
Функция MopClassНайти(Наименование)
	Ответ = Неопределено;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Mop.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.MopClass КАК Mop
	|ГДЕ
	|	Mop.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Наименование",	Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ = Выборка.Ссылка;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервереБезКонтекста
Функция мп_Категории_Найти(Параметры)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Категории.Ссылка КАК мп_Категория,
	|	Категории._MopDivision КАК MopDivision,
	|	Категории._MopDepartment КАК MopDepartment,
	|	Категории._MopSubDepartment КАК MopSubDepartment,
	|	Категории._MopCategory КАК MopCategory,
	|	Категории._MopClass КАК MopClass
	|ИЗ
	|	Справочник.мп_Категории КАК Категории
	|ГДЕ
	|	Категории.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Наименование",	Параметры.мп_Категория);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Параметры, Выборка);
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура Танкер1()
	Колонка_sku			= 0;
	Колонка_ЦенаБазис	= 0;
	Колонка_Цена		= 0;
	Колонка_Артикул		= 0;
	нн		= 1;
	ИмяКолонки			= "/";
	Пока НЕ ПустаяСтрока(ИмяКолонки) Цикл
		ИмяКолонки 	 = ТабДок.Область(1, нн, 1, нн).Текст;
		Если НРег(ИмяКолонки) = "sku" Тогда
			Колонка_sku	= нн;
		ИначеЕсли НРег(ИмяКолонки) = "first price" Тогда
			Колонка_ЦенаБазис	= нн;
		ИначеЕсли НРег(ИмяКолонки) = "last price" Тогда
			Колонка_Цена	= нн;
		ИначеЕсли НРег(ИмяКолонки) = "sale price" Тогда		//	Sale Price
			Колонка_Цена	= нн;
		ИначеЕсли СтрСравнить(СокрЛП(ИмяКолонки), "sales price") = 0 Тогда
			Колонка_Цена	= нн;
		ИначеЕсли НРег(ИмяКолонки) = "option" Тогда
			Колонка_Артикул	= нн;
			
		ИначеЕсли Колонка_ЦенаБазис * Колонка_Цена * Колонка_Артикул > 0 Тогда
			Прервать;
		КонецЕсли;
		нн = нн + 1;
	КонецЦикла;
	
	//	заполнение ЦЕНЫ
	_Артикул	= "@";
	Период		= НачалоЧаса(ТекущаяДатаСеанса());
	Объект.Цены.Очистить();
	Если (Колонка_Артикул + Колонка_sku) * Колонка_Цена > 0 Тогда
		нн	= 1;
		Пока нн <= ?(Объект.ЭтоТест, 99, ТабДок.ВысотаТаблицы) Цикл
			нн = нн + 1;
			Артикул	= "";
			Если Колонка_Артикул = 0 Тогда
				Артикул	= Лев(ТабДок.Область(нн, Колонка_sku, нн, Колонка_sku).Текст, 14);
			Иначе
				Артикул	= ТабДок.Область(нн, Колонка_Артикул, нн, Колонка_Артикул).Текст;
			КонецЕсли;
			Если ПустаяСтрока(Артикул) Тогда
				Прервать;
			ИначеЕсли _Артикул = Артикул Тогда
				Продолжить;
			Иначе
				_Артикул = Артикул;
				
				ТекСтрока	= Новый Структура("Номенклатура", НоменклатураНайти(Артикул));
				Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда Продолжить; КонецЕсли;
				
				Ошибок	= ?(Колонка_ЦенаБазис=0, 1, 0);
				Если Колонка_ЦенаБазис > 0 Тогда
					ТекСтрока.Вставить("ЦенаБазис", ТабДок.Область(нн, Колонка_ЦенаБазис, нн, Колонка_ЦенаБазис).Текст);
					Ошибок	= Ошибок + ?(ПустаяСтрока(ТекСтрока.ЦенаБазис), 1, 0);
				КонецЕсли;
				Если Колонка_Цена > 0 Тогда
					ТекСтрока.Вставить("Цена", ТабДок.Область(нн, Колонка_Цена, нн, Колонка_Цена).Текст);
					Ошибок	= Ошибок + ?(ПустаяСтрока(ТекСтрока.Цена), 2, 0);
				КонецЕсли;
				Если Ошибок > 1 Тогда
					Прервать;
				Иначе
					ТекСтрока.Вставить("Период",		Период);
					ЗаполнитьЗначенияСвойств(Объект.Цены.Добавить(), ТекСтрока);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Танкер2()
	Колонка_sku			= 0;
	Колонка_Размер		= 20;
	Колонка_Вес			= 21;
	Колонка_Артикул		= 0;
	нн		= 2;
	ИмяКолонки			= "/";
	Пока НЕ ПустаяСтрока(ИмяКолонки) Цикл
		ИмяКолонки 	 = ТабДок.Область(3, нн, 3, нн).Текст;
		Если ИмяКолонки = "SKU на Яндексе" Тогда
			Колонка_sku	= нн;
		ИначеЕсли ИмяКолонки = "Габариты с учетом упаковки (см)" Тогда
			Колонка_Размер	= нн;
		ИначеЕсли ИмяКолонки = "Вес с учетом упаковки (брутто, кг)" Тогда
			Колонка_Вес	= нн;
		ИначеЕсли НРег(ИмяКолонки) = "ваш sku" Тогда
			Колонка_Артикул	= нн;
			
		ИначеЕсли Колонка_sku * Колонка_Размер * Колонка_Вес * Колонка_Артикул > 0 Тогда
			Прервать;
		КонецЕсли;
		нн = нн + 1;
	КонецЦикла;
	
	//	заполнение РАЗМЕРЫ
	Объект.Размеры.Очистить();
	Если Колонка_sku * Колонка_Размер * Колонка_Вес * Колонка_Артикул > 0 Тогда
		нн	= 4;
		Пока нн <= ?(Объект.ЭтоТест, 99, ТабДок.ВысотаТаблицы) Цикл
			нн = нн + 1;
			ТекСтрока	= Новый Структура;
			ТекСтрока.Вставить("ЯндексSKU",	ТабДок.Область(нн, Колонка_sku, нн, Колонка_sku).Текст);
			ТекСтрока.Вставить("Артикул",	ТабДок.Область(нн, Колонка_Артикул, нн, Колонка_Артикул).Текст);
			ТекСтрока.Вставить("Размеры", 	ТабДок.Область(нн, Колонка_Размер, нн, Колонка_Размер).Текст);
			ТекСтрока.Вставить("Вес",		ТабДок.Область(нн, Колонка_Вес, нн, Колонка_Вес).Текст);
			Если ПустаяСтрока(ТекСтрока.ЯндексSKU) Тогда
				Прервать;
			Иначе
				мРазмеры = СтрРазделить(ТекСтрока.Размеры, "/");
				Если мРазмеры.Количество() = 3 Тогда
					ТекСтрока.Вставить("Длина", мРазмеры.Получить(0));
					ТекСтрока.Вставить("Ширина", мРазмеры.Получить(1));
					ТекСтрока.Вставить("Высота", мРазмеры.Получить(2));
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(Объект.Размеры.Добавить(), ТекСтрока);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НоменклатураНайти(Артикул)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	Номенклатура.Артикул = &Артикул
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Номенклатура.ПометкаУдаления");
	Запрос.УстановитьПараметр("Артикул",	Артикул);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Справочники.Номенклатура.ПустаяСсылка());
КонецФункции

&НаСервере
Процедура КомандаЦеныЗаписатьНаСервере()
	НаСервере().ЦеныЗаписать();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЦеныЗаписать(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ВидЦены) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено",, "ВидЦены", "Объект.ВидЦены");
	ИначеЕсли ПроверитьЗаполнение() Тогда
		КомандаЦеныЗаписатьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаРазмерыВыгрузитьНаСайт(Команда)
	КомандаРазмерыВыгрузитьНаСайтНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаРазмерыВыгрузитьНаСайтНаСервере()
	НаСервере().РазмерыЗаписать();
КонецПроцедуры

&НаСервере
Функция CARDS_CREATEНаСервере()
	ИмяФайла = НаСервере().CARDS_CREATE();
	Если НЕ ПустаяСтрока(ИмяФайла) Тогда
		//ЧтениеXML	= Новый ЧтениеXML;
		//ЧтениеXML.ОткрытьФайл(ИмяФайла);
		//ПостроительDOM = Новый ПостроительDOM;
		//ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
		//Разыменовыватель = Новый РазыменовательПространствИменDOM(ДокументDOM);
		//Результат = ДокументDOM.ВычислитьВыражениеXPath("yml_catalog/shop/offers/offer/vendorCode", ДокументDOM, Разыменовыватель);
		//Узел = Результат.ПолучитьСледующий();
		
		Возврат ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла));
	КонецЕсли;
	Возврат "";
КонецФункции

&НаКлиенте
Процедура CARDS_CREATE(Команда)
	Адрес	= CARDS_CREATEНаСервере();
	Если НЕ ПустаяСтрока(Адрес) Тогда
		ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(Адрес);
    	ИмяФайла				= ПолучитьИмяВременногоФайла(".yml");
		Попытка
		    ФайлВременногоХранилища.Записать(ИмяФайла);
		    УдалитьИзВременногоХранилища(Адрес);
			//ТабДок.Прочитать(ИмяФайла);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КомандаКатегорииЗаписатьНаСервере()
	Для Каждого ТекСтрока Из Объект.Категории Цикл
		Если ТипЗнч(ТекСтрока.мп_Категория) = Тип("Строка") И НЕ ПустаяСтрока(ТекСтрока.мп_Категория) Тогда
			НовКатегория	= Справочники.мп_Категории.СоздатьЭлемент();
			НовКатегория.Наименование		= ТекСтрока.мп_Категория;
			НовКатегория._MopDivision		= ТекСтрока.MopDivision;
			НовКатегория._MopDepartment		= ТекСтрока.MopDepartment;
			НовКатегория._MopSubDepartment	= ТекСтрока.MopSubDepartment;
			НовКатегория._MopCategory		= ТекСтрока.MopCategory;
			НовКатегория._MopClass			= ТекСтрока.MopClass;
			НовКатегория.УстановитьНовыйКод();
			Если НовКатегория.ПроверитьЗаполнение() Тогда
				Попытка
					НовКатегория.Записать();
					ТекСтрока.Категория	= НовКатегория.Ссылка;
					ТекСтрока.Ошибка	= Ложь;
				Исключение
					Сообщить(ОписаниеОшибки());
					Прервать;
				КонецПопытки;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ТекСтрока.Ошибка И ЗначениеЗаполнено(ТекСтрока.мп_Категория) Тогда
			Если НЕ ПустаяСтрока(ТекСтрока.КатегорияID) И НЕ ПустаяСтрока(ТекСтрока.Категория) Тогда
				НЗ = РегистрыСведений.мп_ДанныеКарточек.СоздатьНаборЗаписей();
				НЗ.Отбор.Аттрибут.Установить(Справочники.мп_АттрибутыКарточек.КатегорияID);
				НЗ.Отбор.СсылкаОбъекта.Установить(ТекСтрока.мп_Категория);
				НЗ.Отбор.ИнтернетМагазин.Установить(Объект.ИнтернетМагазин);
				НЗ.Прочитать();
				Если НЗ.Количество() = 0 Тогда
					ТекЗапись = НЗ.Добавить();
					ТекЗапись.Аттрибут		= Справочники.мп_АттрибутыКарточек.КатегорияID;
					ТекЗапись.СсылкаОбъекта	= ТекСтрока.мп_Категория;
					ТекЗапись.ИнтернетМагазин	= Объект.ИнтернетМагазин;
					ТекЗапись.Значение		= ТекСтрока.КатегорияID;
					НЗ.Записать();
				КонецЕсли;
				НЗ = РегистрыСведений.мп_ДанныеКарточек.СоздатьНаборЗаписей();
				НЗ.Отбор.Аттрибут.Установить(Справочники.мп_АттрибутыКарточек.Категория);
				НЗ.Отбор.СсылкаОбъекта.Установить(ТекСтрока.мп_Категория);
				НЗ.Отбор.ИнтернетМагазин.Установить(Объект.ИнтернетМагазин);
				НЗ.Прочитать();
				Если НЗ.Количество() = 0 Тогда
					ТекЗапись = НЗ.Добавить();
					ТекЗапись.Аттрибут		= Справочники.мп_АттрибутыКарточек.Категория;
					ТекЗапись.СсылкаОбъекта	= ТекСтрока.мп_Категория;
					ТекЗапись.ИнтернетМагазин	= Объект.ИнтернетМагазин;
					ТекЗапись.Значение		= ТекСтрока.Категория;
					НЗ.Записать();
				КонецЕсли;
			КонецЕсли;
				
			Если НЕ ПустаяСтрока(ТекСтрока.КомплектацияID) И НЕ ПустаяСтрока(ТекСтрока.Комплектация) Тогда
				НЗ = РегистрыСведений.мп_ДанныеКарточек.СоздатьНаборЗаписей();
				НЗ.Отбор.Аттрибут.Установить(Справочники.мп_АттрибутыКарточек.КомплектацияID);
				НЗ.Отбор.СсылкаОбъекта.Установить(ТекСтрока.мп_Категория);
				НЗ.Отбор.ИнтернетМагазин.Установить(Объект.ИнтернетМагазин);
				НЗ.Прочитать();
				Если НЗ.Количество() = 0 Тогда
					ТекЗапись = НЗ.Добавить();
					ТекЗапись.Аттрибут		= Справочники.мп_АттрибутыКарточек.КомплектацияID;
					ТекЗапись.СсылкаОбъекта	= ТекСтрока.мп_Категория;
					ТекЗапись.ИнтернетМагазин	= Объект.ИнтернетМагазин;
					ТекЗапись.Значение		= ТекСтрока.КомплектацияID;
					НЗ.Записать();
				КонецЕсли;
				НЗ = РегистрыСведений.мп_ДанныеКарточек.СоздатьНаборЗаписей();
				НЗ.Отбор.Аттрибут.Установить(Справочники.мп_АттрибутыКарточек.Комплектация);
				НЗ.Отбор.СсылкаОбъекта.Установить(ТекСтрока.мп_Категория);
				НЗ.Отбор.ИнтернетМагазин.Установить(Объект.ИнтернетМагазин);
				НЗ.Прочитать();
				Если НЗ.Количество() = 0 Тогда
					ТекЗапись = НЗ.Добавить();
					ТекЗапись.Аттрибут		= Справочники.мп_АттрибутыКарточек.Комплектация;
					ТекЗапись.СсылкаОбъекта	= ТекСтрока.мп_Категория;
					ТекЗапись.ИнтернетМагазин	= Объект.ИнтернетМагазин;
					ТекЗапись.Значение		= ТекСтрока.Комплектация;
					НЗ.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаКатегорииЗаписать(Команда)
	КомандаКатегорииЗаписатьНаСервере();
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервере
Процедура КомандаЦветаСохранитьНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Цветы.СсылкаОбъекта КАК СсылкаОбъекта,
	                      |	ПОДСТРОКА(Цветы.Значение, 1, 30) КАК Значение,
	                      |	Цветы.Аттрибут КАК Аттрибут,
	                      |	ИнтернетМагазины.Наименование ПОДОБНО ""%ozon%"" КАК Порядок,
	                      |	ИнтернетМагазины.Наименование КАК Наименование,
	                      |	Цветы.ИнтернетМагазин КАК ИнтернетМагазин
	                      |ИЗ
	                      |	РегистрСведений.мп_ДанныеКарточек КАК Цветы
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнтернетМагазины КАК ИнтернетМагазины
	                      |		ПО Цветы.ИнтернетМагазин = ИнтернетМагазины.Ссылка
	                      |ГДЕ
	                      |	Цветы.Аттрибут = ЗНАЧЕНИЕ(Справочник.мп_АттрибутыКарточек.Цвет)
	                      |	И ИнтернетМагазины.Язык = &Язык
	                      |	И ПОДСТРОКА(Цветы.Значение, 1, 30) > "" ""
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	СсылкаОбъекта,
	                      |	Порядок УБЫВ,
	                      |	Наименование");
	Запрос.УстановитьПараметр("Язык",				Объект.Язык);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИнтернетМагазин <> Объект.ИнтернетМагазин Тогда
			НЗ = РегистрыСведений.мп_ДанныеКарточек.СоздатьНаборЗаписей();
			НЗ.Отбор.Аттрибут.Установить(Выборка.Аттрибут);
			НЗ.Отбор.СсылкаОбъекта.Установить(Выборка.СсылкаОбъекта);
			НЗ.Отбор.ИнтернетМагазин.Установить(Объект.ИнтернетМагазин);
			НЗ.Прочитать();
			Если НЗ.Количество() = 0 Тогда
				ТекЗапись = НЗ.Добавить();
				ТекЗапись.Аттрибут			= Выборка.Аттрибут;
				ТекЗапись.СсылкаОбъекта		= Выборка.СсылкаОбъекта;
				ТекЗапись.ИнтернетМагазин	= Объект.ИнтернетМагазин;
				ТекЗапись.Значение			= Выборка.Значение;
				Попытка
					НЗ.Записать();
					//Сообщить(Выборка.Значение);
				Исключение
					Сообщить(ОписаниеОшибки());
					Прервать;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЦветаСохранить(Команда)
	КомандаЦветаСохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаГабаритыЗаписатьНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Данные.СсылкаОбъекта КАК СсылкаОбъекта,
	                      |	ПОДСТРОКА(Данные.Значение, 1, 100) КАК Габарит,
	                      |	Данные.Аттрибут КАК Аттрибут
	                      |ИЗ
	                      |	РегистрСведений.мп_ДанныеКарточек КАК Данные
	                      |ГДЕ
	                      |	Данные.Аттрибут = ЗНАЧЕНИЕ(Справочник.мп_АттрибутыКарточек.dimension_unit)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	СсылкаОбъекта");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НЗ = РегистрыСведений.мп_ДанныеКарточек.СоздатьНаборЗаписей();
		НЗ.Отбор.Аттрибут.Установить(Выборка.Аттрибут);
		НЗ.Отбор.СсылкаОбъекта.Установить(Выборка.СсылкаОбъекта);
		НЗ.Отбор.ИнтернетМагазин.Установить(Объект.ИнтернетМагазин);
		НЗ.Прочитать();
		Если НЗ.Количество() = 0 Тогда
			Габарит	= Выборка.Габарит;
			Вес		= "";
			Если СтрЧислоВхождений(Габарит, "/") = 3 Тогда
				Габарит	= Лев(Выборка.Габарит, СтрНайти(Выборка.Габарит, "/",,, 3) - 1);
				Вес		= Сред(Выборка.Габарит, СтрНайти(Выборка.Габарит, "/",,, 3) + 1);
			ИначеЕсли СтрЧислоВхождений(Габарит, "/") = 2 Тогда
				//
			Иначе
				Продолжить;
			КонецЕсли;
			ТекЗапись = НЗ.Добавить();
			ТекЗапись.Аттрибут			= Выборка.Аттрибут;
			ТекЗапись.СсылкаОбъекта		= Выборка.СсылкаОбъекта;
			ТекЗапись.ИнтернетМагазин	= Объект.ИнтернетМагазин;
			ТекЗапись.Значение			= Габарит;
			Попытка
				НЗ.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
				Прервать;
			КонецПопытки;
			Если НЕ ПустаяСтрока(Вес) Тогда
				НЗ = РегистрыСведений.мп_ДанныеКарточек.СоздатьНаборЗаписей();
				НЗ.Отбор.Аттрибут.Установить(Справочники.мп_АттрибутыКарточек.weight_unit);
				НЗ.Отбор.СсылкаОбъекта.Установить(Выборка.СсылкаОбъекта);
				НЗ.Отбор.ИнтернетМагазин.Установить(Объект.ИнтернетМагазин);
				НЗ.Прочитать();
				Если НЗ.Количество() = 0 Тогда
					ТекЗапись = НЗ.Добавить();
					ТекЗапись.Аттрибут			= Справочники.мп_АттрибутыКарточек.weight_unit;
					ТекЗапись.СсылкаОбъекта		= Выборка.СсылкаОбъекта;
					ТекЗапись.ИнтернетМагазин	= Объект.ИнтернетМагазин;
					ТекЗапись.Значение			= Вес;
					Попытка
						НЗ.Записать();
					Исключение
						Сообщить(ОписаниеОшибки());
						Прервать;
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаГабаритыЗаписать(Команда)
	КомандаГабаритыЗаписатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаИмпортЗаписатьНаСервере()
	Для Каждого ТекСтрока Из Объект.Импорт Цикл
		НЗ = РегистрыСведений.мп_ДанныеКарточек.СоздатьНаборЗаписей();
		НЗ.Отбор.Аттрибут.Установить(ТекСтрока.Аттрибут);
		НЗ.Отбор.СсылкаОбъекта.Установить(ТекСтрока.СсылкаОбъекта);
		НЗ.Отбор.ИнтернетМагазин.Установить(ТекСтрока.ИнтернетМагазин);
		НЗ.Прочитать();
		Если НЗ.Количество() = 0 Тогда
			ЗаполнитьЗначенияСвойств(НЗ.Добавить(), ТекСтрока);
			Попытка
				НЗ.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
				Прервать;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаИмпортЗаписать(Команда)
	КомандаИмпортЗаписатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаСписокСгенерироватьНаСервере()
	Запрос	= Новый Запрос(
	"ВЫБРАТЬ
	|	Штрихкоды.Владелец КАК Номенклатура,
	|	Товар.Наименование КАК НоменклатураНаименование,
	//|	Товар.Артикул КАК Артикул,
	//|	Товар.Модель КАК Модель,
	|	ПОДСТРОКА(Данные.Значение, 1, 100) КАК object,
	//|	ПОДСТРОКА(КатегорииИД.Значение, 1, 20) КАК categoryID,
	//|	ПОДСТРОКА(Типы.Значение, 1, 100) КАК Тип,
	//|	ПОДСТРОКА(Габариты.Значение, 1, 100) КАК dimensions,
	//|	ПОДСТРОКА(Весы.Значение, 1, 100) КАК weight,
	|	ПОДСТРОКА(Цветы.Значение, 1, 30) КАК Цвет,
	|	Штрихкоды.Характеристика КАК Характеристика,
	|	ХарактеристикиНоменклатуры.Наименование КАК ХарактеристикаНаименование,
	|	СоставыТкани.НаименованиеЛокальный КАК Состав,
	|	КлассификаторТНВЭД.Код КАК ТНВЭД,
	//|	Данные.СсылкаОбъекта КАК СсылкаОбъекта,
	|	Размеры.Значение КАК РосРазмер,
	|	&ИнтернетМагазин КАК ИнтернетМагазин,
	//|	Штрихкоды.Штрихкод КАК barcode,
	|	ПОДСТРОКА(Родители.Значение, 1, 20) КАК parent,
	|	ПОДСТРОКА(ЕСТЬNULL(Реквизиты.Изображение1, """"), 1, 1) > "" "" КАК ЕстьФото
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товар
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеЦвета КАК НоменклатурныеЦвета
	|			ПО Товар.Цвет = НоменклатурныеЦвета.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.мп_Категории КАК Категории
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.мп_ДанныеКарточек КАК Данные
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.мп_ДанныеКарточек КАК КатегорииИД
	|					ПО Данные.СсылкаОбъекта = КатегорииИД.СсылкаОбъекта
	|						И Данные.ИнтернетМагазин = КатегорииИД.ИнтернетМагазин
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.мп_ДанныеКарточек КАК Типы
	|					ПО Данные.СсылкаОбъекта = Типы.СсылкаОбъекта
	|						И Данные.ИнтернетМагазин = Типы.ИнтернетМагазин
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.мп_ДанныеКарточек КАК Габариты
	|					ПО Данные.СсылкаОбъекта = Габариты.СсылкаОбъекта
	|						И Данные.ИнтернетМагазин = Габариты.ИнтернетМагазин
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.мп_ДанныеКарточек КАК Весы
	|					ПО Данные.СсылкаОбъекта = Весы.СсылкаОбъекта
	|						И Данные.ИнтернетМагазин = Весы.ИнтернетМагазин
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.мп_ДанныеКарточек КАК Родители
	|					ПО Данные.СсылкаОбъекта = Родители.СсылкаОбъекта
	|						И Данные.ИнтернетМагазин = Родители.ИнтернетМагазин
	|				ПО Категории.Ссылка = Данные.СсылкаОбъекта
	|			ПО Товар._MopClass = Категории._MopClass
	|				И Товар._MopDepartment = Категории._MopDepartment
	|				И Товар._MopSubDepartment = Категории._MopSubDepartment
	|				И Товар._MopCategory = Категории._MopCategory
	|				И Товар._MopDivision = Категории._MopDivision
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.мп_ДанныеКарточек КАК Цветы
	|			ПО Товар.Цвет = Цветы.СсылкаОбъекта
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатурныйСоставыТкани КАК НоменклатурныйСоставыТкани
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КТ_НоменклатурныйСоставТкани КАК СоставыТкани
	|				ПО НоменклатурныйСоставыТкани.Наименование = СоставыТкани.Наименование
	|			ПО Товар.СоставТкани = НоменклатурныйСоставыТкани.Ссылка
	|		ПО Штрихкоды.Владелец = Товар.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИнтернетМагазинРазмеры КАК Размеры
	|		ПО Штрихкоды.Владелец._MopClass = Размеры.Категория
	|			И Штрихкоды.Владелец._MopSubDepartment = Размеры.Пол
	|			И Штрихкоды.Характеристика.Наименование = Размеры.Размер
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыТНВЭД.СрезПоследних(, Страна = &Страна) КАК КодыТНВЭД
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|			ПО КодыТНВЭД.ТНВЭД = КлассификаторТНВЭД.Ссылка
	|		ПО Штрихкоды.Владелец = КодыТНВЭД.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО Штрихкоды.Характеристика = ХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеРеквизитовИМ КАК Реквизиты
	|		ПО Штрихкоды.Владелец = Реквизиты.Номенклатура
	|ГДЕ
	|	Данные.ИнтернетМагазин = &ИнтернетМагазин
	|	И Данные.Аттрибут = ЗНАЧЕНИЕ(Справочник.мп_АттрибутыКарточек.Категория)
	|	И КатегорииИД.Аттрибут = ЗНАЧЕНИЕ(Справочник.мп_АттрибутыКарточек.КатегорияID)
	|	И Типы.Аттрибут = ЗНАЧЕНИЕ(Справочник.мп_АттрибутыКарточек.Комплектация)
	|	И Габариты.Аттрибут = ЗНАЧЕНИЕ(Справочник.мп_АттрибутыКарточек.dimension_unit)
	|	И Весы.Аттрибут = ЗНАЧЕНИЕ(Справочник.мп_АттрибутыКарточек.weight_unit)
	|	И Родители.Аттрибут = ЗНАЧЕНИЕ(Справочник.мп_АттрибутыКарточек.parent)
	|	И Цветы.Аттрибут = ЗНАЧЕНИЕ(Справочник.мп_АттрибутыКарточек.Цвет)
	|	И Цветы.ИнтернетМагазин = &ИнтернетМагазин
	|	И Товар.ПометкаУдаления = ЛОЖЬ
	|	И ПОДСТРОКА(Цветы.Значение, 1, 30) > "" ""
	|	И Размеры.ИнтернетМагазин.Страна = &Страна
	|	И СоставыТкани.НаименованиеЛокальный > "" ""
	|	И Штрихкоды.Владелец ССЫЛКА Справочник.Номенклатура
	|	И НЕ (Штрихкоды.Характеристика, Штрихкоды.Владелец) В
	|				(ВЫБРАТЬ
	|					СписокКарточек.Характеристика,
	|					СписокКарточек.Номенклатура
	|				ИЗ
	|					РегистрСведений.мп_СписокСоздаваемыхКарточек КАК СписокКарточек
	|				ГДЕ
	|					СписокКарточек.ИнтернетМагазин = &ИнтернетМагазин)
	|
	|УПОРЯДОЧИТЬ ПО
	|	object,
	|	НоменклатураНаименование,
	|	ХарактеристикаНаименование");
	Запрос.УстановитьПараметр("ИнтернетМагазин",	Объект.ИнтернетМагазин);
	//Запрос.УстановитьПараметр("Дата",				ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Страна",				Объект.Страна);
	Запрос.УстановитьПараметр("Язык",				Объект.Язык);
	Если Объект.ЭтоТест Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	СписокКарточек.Характеристика КАК Характеристика,
		               |	СписокКарточек.Номенклатура КАК Номенклатура,
		               |	&ИнтернетМагазин КАК ИнтернетМагазин,
		               |	СписокКарточек.Цвет КАК Цвет,
		               |	СписокКарточек.Состав КАК Состав,
		               |	СписокКарточек.ТНВЭД КАК ТНВЭД,
		               |	СписокКарточек.Комплектация КАК Комплектация,
		               |	Товар.Наименование КАК ТоварНаименование,
		               |	Характеристики.Наименование КАК ХарактеристикаНаименование,
		               |	Товар._MopClass КАК _MopClass,
		               |	Товар._MopSubDepartment КАК _MopSubDepartment,
		               |	Категории.Ссылка КАК СсылкаОбъекта
		               |ПОМЕСТИТЬ СписокКарточек
		               |ИЗ
		               |	РегистрСведений.мп_СписокСоздаваемыхКарточек КАК СписокКарточек
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК Характеристики
		               |		ПО СписокКарточек.Характеристика = Характеристики.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товар
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.мп_Категории КАК Категории
		               |			ПО Товар._MopClass = Категории._MopClass
		               |				И Товар._MopDepartment = Категории._MopDepartment
		               |				И Товар._MopSubDepartment = Категории._MopSubDepartment
		               |				И Товар._MopCategory = Категории._MopCategory
		               |				И Товар._MopDivision = Категории._MopDivision
		               |		ПО СписокКарточек.Номенклатура = Товар.Ссылка
		               |ГДЕ
		               |	СписокКарточек.ИнтернетМагазин = &ТолькоНеЯндекс
		               |	И Товар.ПометкаУдаления = ЛОЖЬ
		               |	И Характеристики.ПометкаУдаления = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СписокКарточек.Характеристика КАК Характеристика,
		               |	СписокКарточек.Номенклатура КАК Номенклатура,
		               |	СписокКарточек.ИнтернетМагазин КАК ИнтернетМагазин,
		               |	СписокКарточек.Цвет КАК Цвет,
		               |	СписокКарточек.Состав КАК Состав,
		               |	СписокКарточек.ТНВЭД КАК ТНВЭД,
		               |	СписокКарточек.Комплектация КАК Комплектация,
		               |	СписокКарточек.ТоварНаименование КАК ТоварНаименование,
		               |	СписокКарточек.ХарактеристикаНаименование КАК ХарактеристикаНаименование,
		               |	Размеры.Значение КАК РосРазмер
		               |ИЗ
		               |	СписокКарточек КАК СписокКарточек
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИнтернетМагазинРазмеры КАК Размеры
		               |		ПО СписокКарточек._MopClass = Размеры.Категория
		               |			И СписокКарточек._MopSubDepartment = Размеры.Пол
		               |			И СписокКарточек.ХарактеристикаНаименование = Размеры.Размер
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ТоварНаименование,
		               |	ХарактеристикаНаименование";
		Запрос.УстановитьПараметр("ТолькоНеЯндекс",		НаСервере().ТолькоНеЯндекс());
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НЗ = РегистрыСведений.мп_СписокСоздаваемыхКарточек.СоздатьНаборЗаписей();
		НЗ.Отбор.Характеристика.Установить(Выборка.Характеристика);
		НЗ.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
		НЗ.Отбор.ИнтернетМагазин.Установить(Выборка.ИнтернетМагазин);
		НЗ.Прочитать();
		Если НЗ.Количество() = 0 Тогда
			ЗаполнитьЗначенияСвойств(НЗ.Добавить(), Выборка);
			НЗ.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСписокСгенерировать(Команда)
	Если ЗначениеЗаполнено(Объект.ИнтернетМагазин) Тогда
		КомандаСписокСгенерироватьНаСервере();
		ОбновитьОтображениеДанных();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСписокКарточекОчистить(Команда)
	КомандаСписокКарточекОчиститьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаСписокКарточекОчиститьНаСервере()
	НЗ = РегистрыСведений.мп_СписокСоздаваемыхКарточек.СоздатьНаборЗаписей();
	НЗ.Отбор.ИнтернетМагазин.Установить(Объект.ИнтернетМагазин);
	НЗ.Записать();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСписокКарточекЗаписать(Команда)
	Если ПроверитьЗаполнение() Тогда
		КомандаСписокКарточекЗаписатьНаСервере();
		Элементы.СписокСоздаваемыхКарточек.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КомандаСписокКарточекЗаписатьНаСервере()
	Для Каждого ТекСтрока Из Объект.СписокКарточек Цикл
		НЗ = РегистрыСведений.мп_СписокСоздаваемыхКарточек.СоздатьНаборЗаписей();
		НЗ.Отбор.Характеристика.Установить(ТекСтрока.Характеристика);
		НЗ.Отбор.Номенклатура.Установить(ТекСтрока.Номенклатура);
		НЗ.Отбор.ИнтернетМагазин.Установить(Объект.ИнтернетМагазин);
		НЗ.Прочитать();
		Если НЗ.Количество() = 0 Тогда
			ТекЗапись = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(ТекЗапись, ТекСтрока);
			ТекЗапись.ИнтернетМагазин	= Объект.ИнтернетМагазин;
			Если НЗ.ПроверитьЗаполнение() Тогда
				Попытка
					НЗ.Записать();
				Исключение
					Сообщить(ОписаниеОшибки());
					Прервать;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ТекСтрока.Цена > 0 И ЗначениеЗаполнено(Объект.ВидЦены) Тогда
			НЗ = РегистрыСведений.ИнтернетМагазинЦены.СоздатьНаборЗаписей();
			НЗ.Отбор.Период.Установить(ТекСтрока.Период);
			НЗ.Отбор.Номенклатура.Установить(ТекСтрока.Номенклатура);
			НЗ.Отбор.ВидЦены.Установить(Объект.ВидЦены);
			НЗ.Отбор.ИнтернетМагазин.Установить(Объект.ИнтернетМагазин);
			НЗ.Прочитать();
			Если НЗ.Количество() = 0 Тогда
				ТекЗапись = НЗ.Добавить();
				ЗаполнитьЗначенияСвойств(ТекЗапись, ТекСтрока);
				ТекЗапись.ВидЦены			= Объект.ВидЦены;
				ТекЗапись.ИнтернетМагазин	= Объект.ИнтернетМагазин;
				ТекЗапись.Валюта			= Объект.Валюта;
				ТекЗапись.Страна			= Объект.Страна;
				Если НЗ.ПроверитьЗаполнение() Тогда
					Попытка
						НЗ.Записать();
					Исключение
						Сообщить(ОписаниеОшибки());
						Прервать;
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокКарточекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОсновнаяПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если Элементы.ГруппаСписокСоздаваемыхКарточек = ТекущаяСтраница Тогда
		Элементы.СписокСоздаваемыхКарточек.Обновить();
	ИначеЕсли Элементы.ГруппаНапильник = ТекущаяСтраница Тогда
		Элементы.Проблемные.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КомандаПроблемныеКарточкиИсправитьНаСервере()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПОДСТРОКА(Категории.Значение, 1, 100) КАК Категория,
	|	МИНИМУМ(ПОДСТРОКА(КатегорииИД.Значение, 1, 20)) КАК КатегорияИД,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПОДСТРОКА(КатегорииИД.Значение, 1, 20)) КАК Количество,
	|	Категории.Аттрибут КАК Аттрибут,
	|	КатегорииИД.Аттрибут КАК АттрибутИД,
	|	ПОДСТРОКА(КомплектацияИД.Значение, 1, 20) КАК КомплектацияИД
	|ИЗ
	|	РегистрСведений.мп_ДанныеКарточек КАК Категории
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.мп_ДанныеКарточек КАК КатегорииИД
	|		ПО Категории.СсылкаОбъекта = КатегорииИД.СсылкаОбъекта
	|			И Категории.ИнтернетМагазин = КатегорииИД.ИнтернетМагазин
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.мп_ДанныеКарточек КАК КомплектацияИД
	|		ПО Категории.СсылкаОбъекта = КомплектацияИД.СсылкаОбъекта
	|			И Категории.ИнтернетМагазин = КомплектацияИД.ИнтернетМагазин
	|ГДЕ
	|	Категории.Аттрибут = ЗНАЧЕНИЕ(Справочник.мп_АттрибутыКарточек.Категория)
	|	И Категории.ИнтернетМагазин = &ИнтернетМагазин
	|	И КатегорииИД.Аттрибут = ЗНАЧЕНИЕ(Справочник.мп_АттрибутыКарточек.КатегорияID)
	|	И ПОДСТРОКА(КатегорииИД.Значение, 1, 20) > "" ""
	|	И КомплектацияИД.Аттрибут = ЗНАЧЕНИЕ(Справочник.мп_АттрибутыКарточек.КомплектацияID)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПОДСТРОКА(Категории.Значение, 1, 100),
	|	Категории.Аттрибут,
	|	КатегорииИД.Аттрибут,
	|	ПОДСТРОКА(КомплектацияИД.Значение, 1, 20)
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПОДСТРОКА(КатегорииИД.Значение, 1, 20)) > 1
	|
	|УПОРЯДОЧИТЬ ПО
	|	Категория");
	Запрос.УстановитьПараметр("ИнтернетМагазин",	Объект.ИнтернетМагазин);
	Выборка = Запрос.Выполнить().Выбрать();
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	КатегорииИД.СсылкаОбъекта КАК СсылкаОбъекта,
	               |	ПОДСТРОКА(КатегорииИД.Значение, 1, 20) КАК Значение
	               |ИЗ
	               |	РегистрСведений.мп_ДанныеКарточек КАК Категории
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.мп_ДанныеКарточек КАК КатегорииИД
	               |		ПО Категории.СсылкаОбъекта = КатегорииИД.СсылкаОбъекта
	               |			И Категории.ИнтернетМагазин = КатегорииИД.ИнтернетМагазин
	               |ГДЕ
	               |	Категории.ИнтернетМагазин = &ИнтернетМагазин
	               |	И Категории.Аттрибут = &Аттрибут
	               |	И ПОДСТРОКА(Категории.Значение, 1, 100) = &Категория
	               |	И КатегорииИД.Аттрибут = &АттрибутИД
	               |	И ПОДСТРОКА(КатегорииИД.Значение, 1, 20) <> &КатегорияИД
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Значение УБЫВ";
	ГоритСвеча = Истина;
	Пока ГоритСвеча И Выборка.Следующий() Цикл
		Запрос.УстановитьПараметр("Аттрибут",	Выборка.Аттрибут);
		Запрос.УстановитьПараметр("АттрибутИД",	Выборка.АттрибутИД);
		Запрос.УстановитьПараметр("Категория",	Выборка.Категория);
		Запрос.УстановитьПараметр("КатегорияИД",Выборка.КатегорияИД);
		Траблы = Запрос.Выполнить().Выбрать();
		Пока Траблы.Следующий() Цикл
			НЗ = РегистрыСведений.мп_ДанныеКарточек.СоздатьНаборЗаписей();
			НЗ.Отбор.СсылкаОбъекта.Установить(Траблы.СсылкаОбъекта);
			НЗ.Отбор.Аттрибут.Установить(Выборка.АттрибутИД);
			НЗ.Отбор.ИнтернетМагазин.Установить(Объект.ИнтернетМагазин);
			НЗ.Прочитать();
			Для Каждого ТекЗапись Из НЗ Цикл
				Если НРег(СокрЛП(ТекЗапись.Значение)) <> НРег(СокрЛП(Выборка.КатегорияИД)) Тогда
					Сообщить(Выборка.Категория + " " + Выборка.КатегорияИД + " <> " + ТекЗапись.Значение);
					ГоритСвеча = Ложь;
					//Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроблемныеКарточкиИсправить(Команда)
	КомандаПроблемныеКарточкиИсправитьНаСервере();
	Элементы.Проблемные.Обновить();
КонецПроцедуры
